bench/results/allocator-shootout-20260427-022640/mimalloc.h2load.txt
starting benchmark...
spawning thread #0: 1 total client(s). Timing-based test with 2s of warm-up time and 10s of main duration for measurements.
spawning thread #1: 1 total client(s). Timing-based test with 2s of warm-up time and 10s of main duration for measurements.
spawning thread #2: 1 total client(s). Timing-based test with 2s of warm-up time and 10s of main duration for measurements.
spawning thread #3: 1 total client(s). Timing-based test with 2s of warm-up time and 10s of main duration for measurements.
Warm-up started for thread #1.
Warm-up started for thread #0.
Warm-up started for thread #3.
Warm-up started for thread #2.
progress: 100% of clients started
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #2.
Main benchmark duration is started for thread #2.
Warm-up phase is over for thread #3.
Main benchmark duration is started for thread #3.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3
Main benchmark duration is over for thread #1. Stopping all clients.
Stopped all clients for thread #1
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2

finished in 12.00s, 390530.10 req/s, 34.64MB/s
requests: 3905301 total, 3905301 started, 3905301 done, 3905301 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 3905301 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 346.37MB (363192993) total, 284.65MB (298481472) headers (space savings 40.74%), 8.90MB (9327546) data
                     min         max         mean         sd        +/- sd
time for request:       34us      5.36ms       963us       329us    71.01%
time for connect:        0us         0us         0us         0us     0.00%
time to 1st byte:        0us         0us         0us         0us     0.00%
req/s           :   97390.93    97781.93    97629.94      189.31    75.00%